Autodesk.Revit.DB.Structure.RebarBendData.HookOrient1
Identifies the orientation of the termination (e.g. hook, crank) at the end.
The default value is RebarTerminationOrientation::Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.HookOrient0
Identifies the orientation of the termination (e.g. hook, crank) at the start.
The default value is RebarTerminationOrientation::Left.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.Structure.RebarBendData.#ctor(Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Constructs a new RebarBendData using the bar type, hook types, style and orientation values.
barType:
The RebarBarType.
hookType0:
The RebarHookType for the start. Can be null.
hookType1:
The RebarHookType for the end. Can be null.
style:
The style.
terminationOrientation0:
The termination orientation for the start.
terminationOrientation1:
The termination orientation for the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014